[
    {
        "id": 1,
        "key": "A",
        "descriptions": [
            "I was teaching a language class focusing on verbal performance and presentation skills, while teaching about morality and ethics. The assignment was to produce an audio product about a subject. One group asked if they could make a song instead even though songs had not been on the list of the acceptable outputs. If they stayed within the subject, I did not mind. It clearly motivated them even though they ended up creating more work for themselves by also making a music video for the song. This, in turn, also motivated and inspired the rest of the class.",
            "Within a dedicated classroom setting students are given the challenge to start their own company within 20 weeks. The students are given total freedom over what kind of company they want to start. Within entrepreneurial education adapting to individual needs is a must. Not every student is at the same stage of development with their business-know-how, skills and attitude. I had a student of health that had no idea how to start her marketing campaign. In the same group was a student who was almost done with his marketing study program. I connected the two students, giving a challenge to the student that was almost done, so he could apply his knowledge to a real-life situation and the other student got support for her ideas. They both gained a lot of knowledge and enjoyment through supporting each other."
        ]
    },
    {
        "id": 2,
        "key": "B",
        "descriptions": [
            "As a teacher I am sometimes struggling with the set standards of grading papers. I had a student who was supposed to write a paper about a mathematical problem. He only handed in four pages instead of the required 18. As it turned out, the quality of the four pages was so great, that he not only managed to solve the set problem but also go way beyond the set task even though the length of the paper was not enough. After talking with the administration, they allowed me to accept his paper nonetheless.",
            "When I was studying to be a teacher I was really interested in psychology. After talking with the administration, I was able to join a few courses about psychology and integrate them into my studies."
        ]
    },
    {
        "id": 3,
        "key": "C",
        "descriptions": [
            "The aim of the workshop was to teach future teachers that they should assume the role of a coach instead of a teacher when they had a specified face-to-face feedback talk with a student. During the workshop the students asked for further information on methods which focused on talent development. We decided to shorten the curriculum to spare some extra time to get briefly into the methods as well. Thus, the students were happy and I noticed that they had a higher motivation to follow my teachings during the workshop.",
            "In one of my classes on Teaching English as a Foreign Language we were asked to design classroom material on various controversial topics that were supposed to encourage school students to discuss. While discussing possible materials, some groups got into discussions about the topics themselves and did not make progress on the material. The discussions, however, showed how controversial some of the topics were and the students got a deeper insight into what might be important while designing the material. Instead of stopping our discussions to be able to finish the materials in time, our teacher joined the discussions and we were given enough time to finish the materials in the next lesson.",
            "When planning a seminar, I try to come up with a basic content which students should have learned after taking part. In my seminar on working with dyslexic children students do need to understand different theories how struggles in writing can occur. Nevertheless, I also anticipate where I could vary or adapt the curriculum according to the students’ beforehand knowledge or desires. Some students have already worked with dyslexic children in school, and some study German and therefore bring in another expertise. Flexibility in Planning is a core element as I want the students to bring in their interests, knowledge and be able to vary the difficulty of assignments. Students appreciate being taken seriously and the opportunity to contribute to the seminar content."
        ]
    },
    {
        "id": 4,
        "key": "D",
        "descriptions": [
            "As a dance teacher I try to stimulate my students to think about how to use their dance performances to benefit society. One of the students decided to use her knowledge of dance performances in primary education to help pupils feel more self-confident.",
            "Our teachers let us do social and volunteer work during class time. I went to a private school, so they always made sure that we were aware of our own fortunate uprising and that we thought about ways to share our profits with others by helping the ones in need. There were open assignments like “be a volunteer for a whole week” or very specific assignments like “sewing heart-pillows for breast cancer patients”.",
            "My students do an internship which lets them interact with people from other social backgrounds. The aim is to make the students aware of critical situations in society by encounters with people living on the edge of society like the homeless. This way they become aware of their own social standing and learn about the circumstances of other social groupings."
        ]
    },
    {
        "id": 5,
        "key": "E",
        "descriptions": [
            "Instead of giving a lecture about testing procedures in language assessment, I let the students try out the tests themselves. Then they had to come up with the difficulties and benefits of each test. As they had first-hand knowledge of the tests, the exam results in this field were significantly higher than in topics which were lectured about.",
            "When I prepare a class, I try to think about being flexible in where I’ll teach the class. I have noticed that when I arrange my seminaries outside the classroom that my students are more engaged. For instance, for one of my classes to master students we meet up in a café. They work on a task around a round table and not only do they work, it is also a group binding activity. My students are always so grateful and love the experience. Maybe you could also try and find a class suitable of teaching outside a regular classroom.",
            "I teach a class of honors students with very different backgrounds. In previous years I learned that the content was a challenge for some students and too easy for others. To change this, I made different assignments and indicated which grade would be granted after successful completion. First, students considered what grade do they usually got (8/10 or 9/10 or...), then they chose an assignment with the corresponding grade or one grade higher to challenge themselves. This way the class accommodates the different backgrounds and the students have the flexibility in the level of the assignment."
        ]
    },
    {
        "id": 6,
        "key": "F",
        "descriptions": [
            "During one class, I was presenting the rules for an activity and I noticed unease stirring up, so I stopped and I asked the students what they thought about the setup of the activity. To my surprise they came up with a variety of ideas to change the setup and after a discussion, we adapted the rules accordingly. The activity was a success and had it not been for their input, I am sure it would not have worked that well. Starting with this class they were more spontaneous and involved, willing to propose new ideas and ways to improve our work together.",
            "In my Master of Education program, I joined a new program in which teachers and university students worked with high school students. The teenagers had to choose a research question and do an experiment while the teacher trainees supported them. While working, some problems concerning the project’s set up became apparent and we were given the opportunity to make a change and redesign it. Working on an eye- to-eye level with our university teachers created a strong community and led to an identification with the project itself. This project taught me more in a semester than I learned during my whole Bachelor studies."
        ]
    },
    {
        "id": 7,
        "key": "G",
        "descriptions": [
            "Asking full commitment from students and expecting them to actively look for connections with previous learned topics and for ways to exceed their own expectations. Helping them to trust in their abilities and guide them to a higher level than they maybe thought was possible. For an assignment at the end of the year, I asked the students I coached if they could make a video for me. A video to inform other students what they had been doing. At first, they were looking quite puzzled because, as they said, they did not have any skills in making a video. I showed them some footage other students made in different projects and asked them to give it a try. We discussed the most important issues and what we thought would be nice to show in the video. As a result, they went to work and just before the deadline they sent me a link to their video. Though the result was not top-notch up to professional standards, they managed to make an animated video on the topics we discussed and they were proud of the result!",
            "In my second-year class I build on the knowledge of the first-year’s classes. I want my students to understand that they can come a long way with new topics by systematic reasoning and combining the bits and pieces of information that they have. When they ask me a question, I will reply with a question which refers to something they learned before and which will point them in the direction to find the current answer. Sometimes this is sufficient, often another question is needed to guide them. During the course students become aware that there is a link between their classes and that they are able to derive answers even if they have not been taught those directly."
        ]
    },
    {
        "id": 8,
        "key": "H",
        "descriptions": [
            "Students are working on a research project and get really absorbed in it. However, they meet a roadblock when they can't find out more about the practicalities of the field in the research papers. They are really motivated to know more about this field of research outside of the classroom and the teacher notices the student's curiosity. At a lunch meeting they discuss how the teacher got involved in this field of research and share some personal information. Additionally, the teacher gives them more information about other real-life applications and suggests contacting other teachers who also work in similar fields.",
            "One evening the class was almost complete, but one young woman was missing. She came in late and after sitting down, started crying. The group was silent, uneasy, but I asked what troubled her. It turned out, that her boyfriend ended their relationship. This was not in the curriculum nor in the planning of that evening, of course. We started comforting her and after that, the conversation went on about relationship, breaking up, coming back, growing as a person and even about feeling well in school and how much attention and time was spent on these issues. The girl felt much better after leaving class and everyone on that day learned a little bit about life.",
            "Last year I had to do an assessment at school. During this assessment the conversation got a little fiery. It felt like the teacher was not trying to help me while I was nervous, and he offended me with the statements he made. A couple of days after the assessment this teacher ran into me in the hallway and asked me how things were going. He repeated the question after I replied I was fine, stating that he was worried about me after the assessment. I explained to him that instead of the expected constructive feedback I had felt uncomfortable during the assessment. He apologized and told me that if I wanted to have a chat, I could stop by at his office. He said that his door was always open for me. I felt relieved and I got the feeling that he actually cared about me and my achievements."
        ]
    },
    {
        "id": 9,
        "key": "I",
        "descriptions": [
            "For me, being a teacher is being able to open up to my students. When for example, you had a certain experience that is physically showing, I find that it is best to tell students what happened (they will discuss it anyway). For instance, the night before a certain class, I cut my thumb. I had to go to the emergency room where it was completely wrapped up in bandages, so no chance of hiding my injury. So instead of ignoring that something was different, I explained what happened and was also able to relate the incident to content of my class. To my surprise I received no rumors but only interested students as a result!",
            "In courses on individualized support approaches for gifted students, I introduce participants to solution-oriented conversation techniques. Since this is grounded in coaching approaches, authenticity is key. After a short introduction to the theoretical background of each technique, I usually do a live presentation to show them the technique with examples from my own life before asking them to try out the techniques with an authentic issue of their own. In one seminar, my colleague and I talked about something personal that came up spontaneously and really bothered me. The participants were really drawn to it and could identify with me. In the following practice session, everyone dove right into the technique and dared to share personal things, too. In the end, through my personal example, the participants could experience the benefit of the techniques first-hand and were much more motivated to use them in their own class room as well."
        ]
    },
    {
        "id": 10,
        "key": "J",
        "descriptions": [
            "Our teachers in Physics and Math always try to make connections to the different classes we have as they relate and teach about real life problems and new scientific discoveries. When a student asks a question that goes deeper than the planned content of class, they often take time to dive into the topic and encourage us by taking our interests seriously. If there is time, they provide us room to discuss our interests in class or let our questions be answered by other students.",
            "Since I was a child a passion of mine has been learning about space shuttles and traveling through the stars. One of the main inspirations for that passion has been the TV-series Star Trek. The idea behind that show is that all people are united and that in infinite diversity, infinite combinations are possible. An inspiration that emerged from my interest in space travel is a quote from one of the astronauts that landed on the moon. He said that the most mind-blowing experience on the moon was the fact that you can hide the entire earth behind your thumb. Everyone who ever lived and will be was hidden behind his thumb. The fragility of the earth really impacted him in that instance. We only have one earth and must take care of it. I take this quote and understanding into my classroom and try to inspire my students to share their talent and move the world."
        ]
    },
    {
        "id": 11,
        "key": "K",
        "descriptions": [
            "During the pharmacotherapy classes our teacher used to give us assignments that involved the medication history of the patients. Within these assignments we had to analyse the medications that were prescribed to the patients and relate them to the diseases they were suffering from. We also had to think about the choices which were made by the doctors and think about alternative treatments. During these classes we discovered that different medications might have avoided the medication overload as well as the resulting costs. I found this method very useful and it really helped me in developing my critical thinking.",
            "My teacher proposed the next theme for the Psychology class: Gender role - \"It is hard to be a girl or a boy\"? The class was divided into various same-sex groups. They had to find arguments to sustain \"why it is harder to be...boy/girl\", but the boys had to find arguments for the girls and vice versa. Then the groups had to reflect on if they agreed with the other group’s reasoning. In the end, everyone \"experienced\" how it felt to work in another’s shoes.",
            "In third year of the study Leisure & Events Management students learn about the Value Framework, a model which explains about the impact different groups have on social, psychological, economic and ecological level. I set up a lesson where all project teams got the assignment to fill in this framework based on their own project. With this set up I not only achieved to let the students think about the role of their project team and project in society, but I also let them discuss these impacts with other students. The interesting part was that the students gave each other new insights while giving feedback."
        ]
    },
    {
        "id": 12,
        "key": "L",
        "descriptions": [
            "Students studying environmental science were given the task to develop a product which would reduce the university’s CO2 output. A group came up with the idea to sell reusable water bottles. The waste one student can save by using reusable drinking bottles instead of plastic ones is enormous. After presenting a thought-out business and marketing plan, the students started to sell their bottles to all members of the university and thus reduced the plastic waste. Giving students a concrete problem which they can relate to, as it involves their workplace or their personal lives or interests, can help motivate them to grow and develop in a way which can surprise everyone involved.",
            "During my studies to become a teacher, we had to work with elementary school pupils who had difficulties with writing skills. We were each assigned a student who had individual challenges to overcome. While we were meeting with the students in school once a week, we also had to attend a seminar about writing strategies. Practicing what I learned in university with the student helped me to stay motivated and even let me do my own research into the field to help the student as best as I could."
        ]
    },
    {
        "id": 13,
        "key": "M",
        "descriptions": [
            "During one of our weekly honors seminars on the topic of Creative Market, we wanted to teach the students the skill of scrumming. We invited external professionals from the working field to support the students with the process from their idea to a finalized product. As teachers we managed to combine a practical assignment with the theory on how to organize teamwork. The reaction of the students was very positive, as they were not only challenged, but were also able to integrate and apply a new way of working. Having learned not only theoretical knowledge, but also practical knowledge was a reward for the students.",
            "In one of our courses, experts from pharmaceutical industry and hospital are invited to give us lectures on the field of their expertise. For instance, we learned about toxicology studies during the research-phase of a medication by looking at real-life examples from the industry. This helped us not only to understand the course material but also to broaden our horizon in the use of knowledge in the professional setting. These classes were also helpful to us for deciding in which field we would further like to proceed."
        ]
    }
]